Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The methods and constructors of objects created by a class loader may reference other classes.
zh_cn: 类加载器所创建对象的方法和构造方法可以引用其他类。

source: The methods and data of class Character are defined by the information in the UnicodeData file that is part of the Unicode Character Database maintained by the Unicode Consortium.
zh_cn: Character 类的方法和数据是通过 UnicodeData 文件中的信息定义的，该文件是 Unicode Consortium 维护的 Unicode Character Database 的一部分。

source: The methods are synchronized where necessary so that all the operations on any particular instance behave as if they occur in some serial order that is consistent with the order of the method calls made by each of the individual threads involved.
zh_cn: 可以在必要时对这些方法进行同步，因此任意特定实例上的所有操作就好像是以串行顺序发生的，该顺序与所涉及的每个线程进行的方法调用顺序一致。

source: The methods of all classes in java.util.concurrent and its subpackages extend these guarantees to higher-level synchronization.
zh_cn: java.util.concurrent 中所有类的方法及其子包扩展了这些对更高级别同步的保证。

source: The methods that accept an int value support all Unicode characters, including supplementary characters.
zh_cn: 接受一个 int 值的方法支持所有 Unicode 字符，其中包括增补字符。

source: The methods that create processes may not work well for special processes on certain native platforms, such as native windowing processes, daemon processes, Win16/DOS processes on Microsoft Windows, or shell scripts.
zh_cn: 创建进程的方法可能无法针对某些本机平台上的特定进程很好地工作，比如，本机窗口进程，守护进程，Microsoft Windows 上的 Win16/DOS 进程，或者 shell 脚本。

source: The methods that only accept a char value cannot support supplementary characters.
zh_cn: 只接受一个 char 值的方法无法支持增补字符。

source: The methods which require fdlibm semantics are sin, cos, tan, asin, acos, atan, exp, log, log10, cbrt, atan2, pow, sinh, cosh, tanh, hypot, expm1, and log1p.
zh_cn: 需要 fdlibm 语义的方法有 sin、cos、tan、asin、acos、atan、exp、log、log10、cbrt、atan2、pow、sinh、cosh、tanh、hypot、expm1 和 log1p。

source: The minimum priority that a thread can have.
zh_cn: 线程可以具有的最低优先级。

source: The minimum radix available for conversion to and from strings.
zh_cn: 可用于与字符串相互转换的最小基数。

source: The minimum value of a Unicode code point, constant U+0000.
zh_cn: Unicode 代码点 的最小值，常量 U+0000。

source: The minimum value of a Unicode high-surrogate code unit in the UTF-16 encoding, constant '\uD800'.
zh_cn: UTF-16 编码中的 Unicode 高代理项代码单元 的最小值，常量 '\uD800'。

source: The minimum value of a Unicode low-surrogate code unit in the UTF-16 encoding, constant '\uDC00'.
zh_cn: UTF-16 编码中的 Unicode 低代理项代码单元 的最小值，常量 '\uDC00'。

source: The minimum value of a Unicode supplementary code point, constant U+10000.
zh_cn: Unicode 增补代码点 的最小值，常量 U+10000。

source: The minimum value of a Unicode surrogate code unit in the UTF-16 encoding, constant '\uD800'.
zh_cn: UTF-16 编码中的 Unicode 代理项代码单元的最小值，常量 '\uD800'。

source: The most important classes are Object, which is the root of the class hierarchy, and Class, instances of which represent classes at run time.
zh_cn: 最重要的类是 Object（它是类层次结构的根）和 Class（它的实例表示正在运行的应用程序中的类）。

source: The multicast datagram socket class is useful for sending and receiving IP multicast packets.
zh_cn: 多播数据报套接字类用于发送和接收 IP 多播包。

source: The name must match exactly an identifier used to declare an enum constant in this type.
zh_cn: 名称必须与在此类型中声明枚举常量所用的标识符完全匹配。

source: The natural order implemented by this method is the order in which the constants are declared.
zh_cn: 该方法实现的自然顺序就是声明常量的顺序。

source: The natural ordering for a class C is said to be consistent with equals if and only if e1.compareTo(e2) == 0 has the same boolean value as e1.equals(e2) for every e1 and e2 of class C.
zh_cn: 对于类 C 的每一个 e1 和 e2 来说，当且仅当 e1.compareTo(e2) == 0 与 e1.equals(e2) 具有相同的 boolean 值时，类 C 的自然排序才叫做与 equals 一致。

source: The network class loader subclass must define the methods findClass and loadClassData to load a class from the network.
zh_cn: 网络类加载器子类必须定义方法 findClass 和 loadClassData，以实现从网络加载类。

source: The new capacity is the larger of:
zh_cn: 新容量的大小应大于：

source: The new process will invoke the command and arguments given by command(), in a working directory as given by directory(), with a process environment as given by environment().
zh_cn: 在 directory() 指定的工作目录中，利用 environment() 指定的进程环境，新进程将调用由 command() 给出的命令和参数。

source: The new reference is not registered with any queue.
zh_cn: 新的引用没有向任何队列注册。

source: The next size value at which to resize (capacity * load factor).
zh_cn: 下一次调整大小的值（容量 * 加载因子）

source: The number of bits used to represent a byte value in two's complement binary form.
zh_cn: 用于以二进制补码形式表示 byte 值的位数。

source: The number of bits used to represent a double value.
zh_cn: 用于表示 double 值的位数。

source: The number of bits used to represent a float value.
zh_cn: 表示一个 float 值所使用的位数。

source: The number of bits used to represent a long value in two's complement binary form.
zh_cn: 用来以二进制补码形式表示 long 值的位数。

source: The number of bits used to represent a short value in two's complement binary form.
zh_cn: 用来以二进制补码形式表示 short 值的位数。

source: The number of bits used to represent a char value in unsigned binary form, constant 16.
zh_cn: 用来以无符号二进制形式表示 char 值的位数，常量 16。

source: The number of bits used to represent an int value in two's complement binary form.
zh_cn: 用来以二进制补码形式表示 int 值的比特位数。

source: The number of bytes used to represent a byte value in two's complement binary form.
zh_cn: 用于以二进制补码形式表示 byte 值的字节数。

source: The number of bytes used to represent a char value in unsigned binary form.
zh_cn: 用来以无符号二进制形式表示 char 值的字节数。

source: The number of bytes used to represent a double value.
zh_cn: 表示一个 double 值所使用的字节数。

source: The number of bytes used to represent a float value.
zh_cn: 表示一个 float 值所使用的字节数。

source: The number of bytes used to represent a int value in two's complement binary form.
zh_cn: 用于以二进制补码形式表示 int 值的字节数。

source: The number of bytes used to represent a long value in two's complement binary form.
zh_cn: 用于以二进制补码形式表示 long 值的字节数。

source: The number of bytes used to represent a short value in two's complement binary form.
zh_cn: 用于以二进制补码形式表示 short 值的字节数。

source: The number of dimensions of the new array must not exceed the number of array dimensions supported by the implementation (typically 255).
zh_cn: 新数组的维数不能超过该实现所支持的数组维数（通常为 255）。

source: The number of key-value mappings contained in this map.
zh_cn: 此映射中包含的键值映射的数量。

source: The number of times this HashMap has been structurally modified Structural modifications are those that change the number of mappings in the HashMap or otherwise modify its internal structure (e.g., rehash).
zh_cn: 这个 HashMap 被结构修改的次数，结构修改是那些改变 HashMap 中的映射数量或修改其内部结构（例如，rehash）的修改。

source: The only family of subsets defined in the Character class is Character.UnicodeBlock.
zh_cn: Character 类中定义的唯一子集系列是 Character.UnicodeBlock。

source: The operating system program file was not found.
zh_cn: 未找到操作系统程序文件。

source: The other way to create a thread is to declare a class that implements the Runnable interface.
zh_cn: 创建线程的另一种方法是声明实现 Runnable 接口的类。

source: The overall effect is exactly as if the argument were converted to a char array by the method toChars(int) and the character in that array were then ERROR(appended/#append(char[]) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 Character.toChars(int) 方法将参数转为 char 数组，然后将数组中的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(Object), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(Object) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(boolean), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(boolean) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(char), and the character in that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(char) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(char[]), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(char[]) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(double), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(double) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(float), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(float) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(int), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(int) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the argument were converted to a string by the method valueOf(long), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(long) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the arguments were converted to a string by the method valueOf(char[], int, int), and the characters of that string were then ERROR(appended/#append(String) appended) to this character sequence.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(char[], int, int) 方法将参数转换为字符串，然后将所得字符串的字符追加到此字符序列。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(Object), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(Object) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(boolean), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(boolean) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(char), and the character in that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(char) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(char[]), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(char[]) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(double), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(double) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(float), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(float) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(int), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(int) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The overall effect is exactly as if the second argument were converted to a string by the method valueOf(long), and the characters of that string were then ERROR(inserted/#insert(int,String) inserted) into this character sequence at the indicated offset.
zh_cn: 该方法的最终效果与以下操作过程的效果相同：先使用 valueOf(long) 方法将第二个参数转换为字符串，然后将所得字符串的字符插入到此字符序列的指定位置。

source: The parent process uses these streams to feed input to and get output from the subprocess.
zh_cn: 父进程使用这些流来提供到子进程的输入和获得从子进程的输出。

source: The precise meaning of "copy" may depend on the class of the object.
zh_cn: “副本”的准确含义可能依赖于对象的类。

source: The primitive Java types (boolean, byte, char, short, int, long, float, and double), and the keyword void are also represented as Class objects.
zh_cn: 基本的 Java 类型（ boolean 、 byte 、 char 、 short 、 int 、 long 、 float 和 double ）和关键字 void 也表示为 Class 对象。

source: The principal operations on a StringBuffer are the append and insert methods, which are overloaded so as to accept data of any type.
zh_cn: StringBuffer 上的主要操作是 append 和 insert 方法，可重载这些方法，以接受任意类型的数据。

source: The principal operations on a StringBuilder are the append and insert methods, which are overloaded so as to accept data of any type.
zh_cn: 在 StringBuilder 上的主要操作是 append 和 insert 方法，可重载这些方法，以接受任意类型的数据。

source: The program may remove references from a queue either by polling or by blocking until a reference becomes available.
zh_cn: 通过轮询或阻塞，直到获得了引用，程序才可以从队列中移除引用。

source: The proxy class will be defined by the specified class loader and will implement all of the supplied interfaces.
zh_cn: 该代理类将由指定的类加载器定义，并将实现提供的所有接口。

source: The quality of implementation specifications concern two properties, accuracy of the returned result and monotonicity of the method.
zh_cn: 实现规范的质量涉及到两种属性，即返回结果的准确性和方法的单调性。

source: The range of legal code points is now U+0000 to U+10FFFF, known as Unicode scalar value.
zh_cn: 合法代码点 的范围现在是从 U+0000 到 U+10FFFF，即通常所说的 Unicode 标量值。

source: The reader/writer facility, available through the javax.sql.RowSet group of interfaces, can be customized to use and update data from a spread sheet, flat file, or any other tabular data source.
zh_cn: 通过接口的 javax.sql.RowSet 组可以使用的 reader/writer 实用程序，可以被定制以使用和更新来自电子表格、纯文本文件或其他任何表格式数据源的数据。

source: The recommended language is "Note: this class has a natural ordering that is inconsistent with equals."
zh_cn: 推荐如此阐述：“注意：此类具有与 equals 不一致的自然排序。”

source: The recommended usage is to use URI to identify resources, then convert it into a URL when it is time to access the resource.
zh_cn: 建议的用法是使用 URI 指定资源，然后在访问资源时将其转换为 URL。

source: The recording of this causal information is referred to as the chained exception facility, as the cause can, itself, have a cause, and so on, leading to a "chain" of exceptions, each caused by another.
zh_cn: 这种因果信息的记录被称为异常链 设施，因为 cause 自身也会有 cause，依此类推，就形成了异常链，每个异常都是由另一个异常引起的。

source: The reflected field may be a class (static) field or an instance field.
zh_cn: 反射的字段可能是一个类（静态）字段或实例字段。

source: The reflected method may be a class method or an instance method (including an abstract method).
zh_cn: 所反映的方法可能是类方法或实例方法（包括抽象方法）。

source: The relationship between a registered reference object and its queue is one-sided.
zh_cn: 已注册的引用对象及其队列之间的关系是单向的。

source: The reliability of this method is important for the ability to use it to make security decisions, so its implementation should not just test if the class in question extends Proxy.
zh_cn: 此方法的可靠性对于使用它做出安全决策而言非常重要，所以此方法的实现不应仅测试相关的类是否可以扩展 Proxy。

source: The result is that two threads are running concurrently: the current thread (which returns from the call to the start method) and the other thread (which executes its run method).
zh_cn: 结果是两个线程并发地运行；当前线程（从调用返回给 start 方法）和另一个线程（执行其 run 方法）。

source: The result of comparing two objects that implement CharSequence is therefore, in general, undefined.
zh_cn: 因此，通常未定义比较实现 CharSequence 的两个对象的结果。

source: The result of this method is exactly the same as if it were an invocation of this object's ERROR(insert/#insert(int,CharSequence,int,int) insert)(dstOffset, s, 0, s.length()) method.
zh_cn: 此方法的结果与调用此对象的 ERROR(insert/#insert(int,CharSequence,int,int) insert)(dstOffset, s, 0, s.length()) 方法的结果完全相同。

source: The result of this method is exactly the same as if it were an invocation of this.append(s, 0, s.length());
zh_cn: 此方法的最终效果与调用 this.append(s, 0, s.length()) 方法的效果完全相同。

source: The result should be a concise but informative representation that is easy for a person to read.
zh_cn: 结果应是一个简明但易于读懂的信息表达式。

source: The resulting proxy class must not exceed any limits imposed on classes by the virtual machine.
zh_cn: 得到的代理类必须不超过虚拟机在类上施加的任何限制。

source: The results of a write by one thread are guaranteed to be visible to a read by another thread only if the write operation happens-before the read operation.
zh_cn: 只有写入操作 happen-before 读取操作时，才保证一个线程写入的结果对另一个线程的读取是可视的。

source: The returned Class object is the object that is locked by static synchronized methods of the represented class.
zh_cn: 返回的 Class 对象是由所表示类的 static synchronized 方法锁定的对象。

source: The returned index is the largest value k such that
zh_cn: 返回的索引是满足以下条件的最大 k 值：

source: The returned list is not a copy.
zh_cn: 该返回的列表不是 一份副本。

source: The returned map and its collection views may not obey the general contract of the equals(Object) and hashCode() methods.
zh_cn: 返回的映射及其集合视图不能遵守 equals(Object) 和 hashCode() 方法的常规协定。

source: The returned map does not permit null keys or values.
zh_cn: 返回的映射不允许空键或空值。

source: The returned map is typically case-sensitive on all platforms.
zh_cn: 返回的映射通常在所有平台上都是区分大小写的。

source: The returned object may be modified using ordinary Map operations.
zh_cn: 可以使用普通的 Map 操作来修改返回的对象。

source: The returned string may, but is not required to, contain the value as well.
zh_cn: 返回的字符串可以，但不一定包含该值。

source: The returned value may be null -- this means to use the working directory of the current Java process, usually the directory named by the system property user.dir, as the working directory of the child process.
zh_cn: 返回值可以为 null，这意味着要使用当前 Java 进程的工作目录，通常是由系统属性 user.dir 指定的目录作为子进程的工作目录。

source: The rightmost empty string "" is considered to occur at the index value this.length().
zh_cn: 将最右边的空字符串 "" 视为出现在索引值 this.length() 处。

source: The root class from which all event state objects shall be derived.
zh_cn: 所有事件状态对象都将从其派生的根类。

source: The root interface in the collection hierarchy.
zh_cn: Collection 层次结构 中的根接口。

source: The root of a tree bin is normally its first node.
zh_cn: 树 bin 的根节点通常是它的第一个节点。

source: The runtime doesn't have enough information on which references to clear and which to keep.
zh_cn: 运行时没有足够的信息来清除哪些引用和保留哪些引用。

source: The same example in this other style looks like the following:
zh_cn: 采用这种风格的同一个例子如下所示：

source: The scheduler is free to ignore this hint.
zh_cn: 调度是可以忽略这个提示。

source: The sequence is changed to a new character sequence whose length is specified by the argument.
zh_cn: 序列将被更改为一个新的字符序列，新序列的长度由参数指定。

source: The set is backed by the map, so changes to the map are reflected in the set, and vice-versa.
zh_cn: 该 set 受映射支持，所以对映射的更改将反映在此 set 中，反之亦然。

source: The set of classes that make up the package may implement a particular specification and if so the specification title, version number, and vendor strings identify that specification.
zh_cn: 组成包的类集可以实现一个特定规范，如此一来，就可以通过规范标题、版本号和供应商字符串来标识该规范。

source: The set supports element removal, which removes the corresponding mapping from the map, via the Iterator.remove, Set.remove, removeAll, retainAll, and clear operations.
zh_cn: 该 set 支持元素的移除，通过 Iterator.remove、Set.remove、removeAll、retainAll 和 clear 操作可从该映射中移除相应的映射关系。

source: The set supports element removal, which removes the corresponding mapping from the map, via the Iterator.remove, Set.remove, removeAll, retainAll and clear operations.
zh_cn: 该 set 支持元素的移除，通过 Iterator.remove、Set.remove、removeAll、retainAll 和 clear 操作可从该映射中移除相应的映射关系。

source: The sets of modifiers are represented as integers with distinct bit positions representing different modifiers.
zh_cn: 修饰符集被表示为整数，用不同的位位置 (bit position) 表示不同的修饰符。

source: The smallest table capacity for which bins may be treeified.
zh_cn: bins 可能被树化的最小表容量。

source: The space of class names that begin with the string "$Proxy" should be, however, reserved for proxy classes.
zh_cn: 但是，以字符串 "$Proxy" 开头的类名空间应该为代理类保留。

source: The specification of the java.nio.charset.Charset class describes the naming conventions for character encodings as well as the set of standard encodings that must be supported by every implementation of the Java platform.
zh_cn: java.nio.charset.Charset 类的规范描述了字符编码的命名约定，以及每个 Java 平台实现必须支持的标准编码集。

source: The specifications of these methods enable implementations to employ efficient machine-level atomic instructions that are available on contemporary processors.
zh_cn: 这些方法的规范使实现能够使用当代处理器上提供的高效机器级别原子指令。

source: The specified amount of real time has elapsed, more or less.
zh_cn: 大约已经到达指定的实际时间。

source: The start argument must be nonnegative, and not greater than end.
zh_cn: start 参数必须为非负，但不得大于 end。

source: The static Proxy.getInvocationHandler method will return the invocation handler associated with the proxy instance passed as its argument.
zh_cn: 静态 Proxy.getInvocationHandler 方法将返回与作为其参数传递的代理实例相关的调用处理程序。

source: The static methods allow a package to be found by name or the set of all packages known to the current class loader to be found.
zh_cn: 静态方法允许通过名称或当前类加载器已知的所有包的集合来找到包。

source: The stream obtains data piped from the error output of the process represented by this Process object.
zh_cn: 该流获得由本 Process 对象所表示的进程的错误输出管道的数据。

source: The stream obtains data piped from the standard output of the process represented by this Process object.
zh_cn: 该流获得由本 Process 对象所表示的进程的标准输出管道的数据。

source: The string tokenizer class allows an application to break a string into tokens.
zh_cn: string tokenizer 类允许应用程序将字符串分解为标记。

source: The subarray begins at the specified offset and extends len chars.
zh_cn: 子数组从指定的 offset 开始，包含 len 个 char。

source: The subprocess is not killed when there are no more references to the Process object, but rather the subprocess continues executing asynchronously.
zh_cn: 当没有 Process 对象的更多引用时，不是删掉子进程，而是继续异步执行子进程。

source: The subprocess represented by this Process object is forcibly terminated.
zh_cn: 强制终止此 Process 对象表示的子进程。

source: The subsequence of the argument s specified by start and end are inserted, in order, into this sequence at the specified destination offset, moving up any characters originally above that position.
zh_cn: 由 start 和 end 指定的参数 s 的子序列按顺序插入到该序列中指定的目标偏移量处，最初位于该位置上方的任何字符向上移动。

source: The subsequence starts with the char value at the specified index and ends with the char value at index end - 1.
zh_cn: 子序列从指定序列的 char 值开始，并在索引 end - 1 的 char 值结束。

source: The substring begins at the specified start and extends to the character at index end - 1 or to the end of the sequence if no such character exists.
zh_cn: 该子字符串从指定的 start 处开始，一直到索引 end - 1 处的字符，如果不存在这种字符，则一直到序列尾部。

source: The substring begins at the specified start and extends to the character at index end - 1.
zh_cn: 该子字符串从指定的 start 处开始，一直到索引 end - 1 处的字符。

source: The substring begins at the specified index and extends to the end of this sequence.
zh_cn: 该子字符串始于指定索引处的字符，一直到此字符串末尾。

source: The table, initialized on first use, and resized as necessary.
zh_cn: 表，在初次使用时初始化，并根据需要调整大小。
